## Pandas_Practice_01

In [1]:
import pandas as pd
import numpy as np

### Q1.

1. 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

In [21]:
s1 =  pd.Series([1, 2, 3, 4],
              index=["v1", "v2", "v3", "v4"])
s1

v1    1
v2    2
v3    3
v4    4
dtype: int64

In [22]:
s2 =  pd.Series([4, 5, 6, 10],
              index=["v1", "v2", "v3", "v5"])
s2

v1     4
v2     5
v3     6
v5    10
dtype: int64

2. 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [23]:
s1 + s2

v1    5.0
v2    7.0
v3    9.0
v4    NaN
v5    NaN
dtype: float64

In [24]:
s1 - s2 # error

v1   -3.0
v2   -3.0
v3   -3.0
v4    NaN
v5    NaN
dtype: float64

In [25]:
s1 / s2

v1    0.25
v2    0.40
v3    0.50
v4     NaN
v5     NaN
dtype: float64

In [26]:
s1 * s2

v1     4.0
v2    10.0
v3    18.0
v4     NaN
v5     NaN
dtype: float64

### Q2.

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다. <br>

1. 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다. 
2. 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [50]:
data = {
    "국어": [100, 80, 90, 92, 80],
    "수학": [100, 60, 98, 80, 90],
    "영어": [100, 90, 90, 60, 70],
    "과학": [100, 70, 99, 89, 70],
    "등수": ["1", "5", "2", "3", "4"],
    "성적증감율": [0.00, 1.16, 1.20, 1.52, 1.13]
}
columns = ["등수", "국어", "수학", "영어", "과학", "성적증감율"]
index = ["박진원", "신은총", "권재", "조웅", "진영"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    등수   국어   수학   영어   과학  성적증감율
박진원  1  100  100  100  100   0.00
신은총  5   80   60   90   70   1.16
권재   2   90   98   90   99   1.20
조웅   3   92   80   60   89   1.52
진영   4   80   90   70   70   1.13

### Q3.

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [15]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}

columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

1. 모든 학생의 수학 점수를 시리즈로 나타낸다.

In [16]:
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [17]:
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [18]:
df["평균"] = round((df["국어"] + df["영어"] + df["수학"])/3, 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

4. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

In [19]:
df["영어"]["방자"] = 80
df["평균"] = round((df["국어"] + df["영어"] + df["수학"])/3, 2)
df

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

5. 춘향의 점수를 데이터프레임으로 나타낸다.

In [20]:
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

6. 향단의 점수를 시리즈로 나타낸다.

In [35]:
s = pd.Series([df["국어"]["향단"], df["영어"]["향단"], df["수학"]["향단"], df["평균"]["향단"]],
         index=df.columns)
s.name = "향단"
s

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [34]:
df.loc["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

### Q4.

1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [37]:
df = pd.DataFrame(np.arange(0,25).reshape(5,5), index = ['a','b','c','d','e'], columns=['A','B','C','D','E'])
df

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [38]:
df['A']

a     0
b     5
c    10
d    15
e    20
Name: A, dtype: int32

In [39]:
df.A

a     0
b     5
c    10
d    15
e    20
Name: A, dtype: int32

In [40]:
df.loc['a']

A    0
B    1
C    2
D    3
E    4
Name: a, dtype: int32

In [41]:
df.iloc[0,:]

A    0
B    1
C    2
D    3
E    4
Name: a, dtype: int32

In [42]:
df["a":"b"]

   A  B  C  D  E
a  0  1  2  3  4
b  5  6  7  8  9

In [43]:
df.at["a","A"]

0

In [44]:
df.iat[0,0]

0

In [45]:
df[:1]

   A  B  C  D  E
a  0  1  2  3  4

In [46]:
df[0:1]

   A  B  C  D  E
a  0  1  2  3  4

In [52]:
df.loc[:,"D"]

a     3
b     8
c    13
d    18
e    23
Name: D, dtype: int32

### Q5.

다음 명령으로 타이타닉호 승객 데이터를 데이터프레임으로 읽어온다. 이 명령을 실행하려면 seaborn 패키지가 설치되어 있어야 한다.

In [2]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

타이타닉호 승객 데이터의 데이터 값을 각 열마다 구해본다.

In [56]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [57]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### Q6.

타이타닉호 승객중 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [73]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [74]:
titanic.age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
28.00    25
21.00    24
25.00    23
36.00    22
29.00    20
32.00    18
27.00    18
35.00    18
26.00    18
16.00    17
31.00    17
20.00    15
33.00    15
23.00    15
34.00    15
39.00    14
17.00    13
42.00    13
40.00    13
45.00    12
38.00    11
50.00    10
2.00     10
4.00     10
47.00     9
         ..
71.00     2
59.00     2
63.00     2
0.83      2
30.50     2
70.00     2
57.00     2
0.75      2
13.00     2
10.00     2
64.00     2
40.50     2
32.50     2
45.50     2
20.50     1
24.50     1
0.67      1
14.50     1
0.92      1
74.00     1
34.50     1
80.00     1
12.00     1
36.50     1
53.00     1
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [77]:
titanic["class"].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [78]:
titanic.alive.value_counts()

no     549
yes    342
Name: alive, dtype: int64

### Q7.

In [3]:
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해 '미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다. 각 그룹 별로 비율의 전체 합은 1이 되어야 한다.

In [17]:
titanic["age_cat"] = pd.cut(titanic.age, bins, labels=labels)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_cat
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,장년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,중년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,중년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,중년

In [18]:
alive =  titanic.loc[titanic.alive == 'yes',['alive','age_cat']]
dead =  titanic.loc[titanic.alive == 'no',['alive','age_cat']]

In [38]:
alive_prob = alive.age_cat.value_counts()/alive.age_cat.count()
alive_prob

중년      0.298561
장년      0.280576
청년      0.269784
미성년자    0.133094
노년      0.017986
Name: age_cat, dtype: float64

In [39]:
dead_prob = dead.age_cat.value_counts()/dead.age_cat.count()
dead_prob

청년      0.338863
장년      0.277251
중년      0.267773
미성년자    0.075829
노년      0.040284
Name: age_cat, dtype: float64